/*
3 Вывести на экран слово “JAVA”, в столбик, чтобы оно повторилось 10 раз,
используя цикл на ваше усмотрение (for или while).
Вывод в консоль должен быть таким:
JAVA
JAVA
JAVA
JAVA
JAVA
JAVA
JAVA
JAVA
JAVA
JAVA
*/
package day1;

public class Task3 {
    public static void main(String[] args) {

        int a = 0;
        while (a < 10){
            System.out.println("JAVA");
            a++;
        }

    }
}
